Catalogs/РазделыНоменклатурыДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>РазделыНоменклатурыДел</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РазделыНоменклатурыДел/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСтруктуруРазделаНоменклатурыДел() Экспорт 
	
	ПараметрыРазделаНоменклатурыДел = Новый Структура;
	ПараметрыРазделаНоменклатурыДел.Вставить("Год");
	ПараметрыРазделаНоменклатурыДел.Вставить("Индекс");
	ПараметрыРазделаНоменклатурыДел.Вставить("Наименование");
	ПараметрыРазделаНоменклатурыДел.Вставить("Родитель");
	ПараметрыРазделаНоменклатурыДел.Вставить("Подразделение");
	ПараметрыРазделаНоменклатурыДел.Вставить("Организация");
	
	Возврат ПараметрыРазделаНоменклатурыДел;
	
КонецФункции	

Функция СоздатьРазделНоменклатурыДел(СтруктураРазделаНоменклатурыДел) Экспорт 
	
	НовыйРазделНД = Справочники.РазделыНоменклатурыДел.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйРазделНД, СтруктураРазделаНоменклатурыДел);
	НовыйРазделНД.Записать();
	
	Возврат НовыйРазделНД.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
